/*
 * _iwdg.h
 *
 *  Created on: Feb 6, 2022
 *      Author: ctbri
 */

#ifndef INC__IWDG_H_
#define INC__IWDG_H_

/********************************************************************
 *	BIBLIOTECAS
 ********************************************************************/
#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"


/********************************************************************
 *	DEFINIÇÃO DE CONSTANTES
 ********************************************************************/
// Não possui


/********************************************************************
 *	TIPOS DE DADO
 ********************************************************************/
typedef enum
{
	IWDG_PRESCALER_4	= 0,
	IWDG_PRESCALER_8	= 1,
	IWDG_PRESCALER_16	= 2,
	IWDG_PRESCALER_32	= 3,
	IWDG_PRESCALER_64	= 4,
	IWDG_PRESCALER_128	= 5,
	IWDG_PRESCALER_256	= 6
} iwdg_prescaler_t;


/********************************************************************
 *	DECLARAÇÃO DE VARIÁVEIS
 ********************************************************************/
// Não possui


/********************************************************************
 *	DECLARAÇÃO DAS SUBROTINAS
 ********************************************************************/
void InicializaIWDG (uint16_t timeRegister, iwdg_prescaler_t prescaler);
void ResetaIWDG (void);

/********************************************************************
 *	DEFINIÇÃO DE MACROS
 ********************************************************************/
// Não possui


#endif /* INC__IWDG_H_ */
