/*
 * _iwdg.h
 *
 *  Created on: Feb 6, 2022
 *      Author: ctbri
 */

#ifndef INC__IWDG_H_
#define INC__IWDG_H_

/********************************************************************
 *	BIBLIOTECAS
 ********************************************************************/
#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"

#include "iwdg.h"

/********************************************************************
 *	DEFINIÇÃO DE CONSTANTES
 ********************************************************************/
// Tempo de IWatchdog de 5 segundos, c/ prescaler de 64
#define IWDG_TIME_5S	(2499)


/********************************************************************
 *	TIPOS DE DADO
 ********************************************************************/
// Não possui


/********************************************************************
 *	DECLARAÇÃO DAS SUBROTINAS
 ********************************************************************/
void InicializaIWDG (IWDG_HandleTypeDef *hiwdg);
void ResetaIWDG (IWDG_HandleTypeDef *hiwdg);

/********************************************************************
 *	DEFINIÇÃO DE MACROS
 ********************************************************************/
// Não possui


#endif /* INC__IWDG_H_ */
